In [1]:
import pandas as pd
import

In [4]:
import pandas as pd

In [67]:
d_info=[{'day':1/1/2017,'temperature':32,'windspeed':6,'event':'Rain'},
       {'day':1/2/2017,'temperature':35,'windspeed':7,'event':"Sunny"},
        {'day':1/3/2017,'temperature':28,'windspeed':2,'event':"Snow"},
        {'day':1/4/2017,'temperature':24,'windspeed':4,'event':"Snow"},
        {'day':1/5/2017,'temperature':32,'windspeed':7,'event':"Rain"},
       {'day':1/6/2017,'temperature':31,'windspeed':2,'event':"Sunny"}]
df=pd.DataFrame(d_info)
df

   day  event  temperature  windspeed
0    0   Rain           32          6
1    0  Sunny           35          7
2    0   Snow           28          2
3    0   Snow           24          4
4    0   Rain           32          7
5    0  Sunny           31          2

In [10]:
df.to_csv("d_info.csv")# create csv
df.to_csv("d_info.json")
df

   day  event  temperature  windspeed
0    0   Rain           32          6
1    0  Sunny           35          7
2    0   Snow           28          2
3    0   Snow           24          4
4    0   Rain           32          7
5    0  Sunny           31          2

In [11]:
df.to_json()

'{"day":{"0":0,"1":0,"2":0,"3":0,"4":0,"5":0},"event":{"0":"Rain","1":"Sunny","2":"Snow","3":"Snow","4":"Rain","5":"Sunny"},"temperature":{"0":32,"1":35,"2":28,"3":24,"4":32,"5":31},"windspeed":{"0":6,"1":7,"2":2,"3":4,"4":7,"5":2}}'

In [12]:
df.to_csv()

',day,event,temperature,windspeed\n0,0,Rain,32,6\n1,0,Sunny,35,7\n2,0,Snow,28,2\n3,0,Snow,24,4\n4,0,Rain,32,7\n5,0,Sunny,31,2\n'

In [17]:
df=pd.read_csv('E:\python\pythonnotes\d_info.csv')

In [21]:
df.shape

(6, 5)

In [27]:
df.columns

Index([u'Unnamed: 0', u'day', u'event', u'temperature', u'windspeed'], dtype='object')

In [29]:
df[1:3]

   Unnamed: 0  day  event  temperature  windspeed
1           1    0  Sunny           35          7
2           2    0   Snow           28          2

In [32]:
#df['day']
df.day

0    0
1    0
2    0
3    0
4    0
5    0
Name: day, dtype: int64

In [33]:
df[['day','event']]

   day  event
0    0   Rain
1    0  Sunny
2    0   Snow
3    0   Snow
4    0   Rain
5    0  Sunny

In [35]:
df[['day','event','windspeed']]

   day  event  windspeed
0    0   Rain          6
1    0  Sunny          7
2    0   Snow          2
3    0   Snow          4
4    0   Rain          7
5    0  Sunny          2

In [38]:
# min
df['windspeed'].max()

7

In [39]:
df['windspeed'].min()

2

In [41]:
df['temperature']

0    32
1    35
2    28
3    24
4    32
5    31
Name: temperature, dtype: int64

In [42]:
df['temperature'].max()

35

In [46]:
df[df['temperature']>32]

   Unnamed: 0  day  event  temperature  windspeed
1           1    0  Sunny           35          7

In [44]:
df[df['temperature']==df['temperature'].max()]

   Unnamed: 0  day  event  temperature  windspeed
1           1    0  Sunny           35          7

In [47]:
df.describe()

       Unnamed: 0  day  temperature  windspeed
count    6.000000  6.0     6.000000   6.000000
mean     2.500000  0.0    30.333333   4.666667
std      1.870829  0.0     3.829708   2.338090
min      0.000000  0.0    24.000000   2.000000
25%      1.250000  0.0    28.750000   2.500000
50%      2.500000  0.0    31.500000   5.000000
75%      3.750000  0.0    32.000000   6.750000
max      5.000000  0.0    35.000000   7.000000

In [48]:
df

   Unnamed: 0  day  event  temperature  windspeed
0           0    0   Rain           32          6
1           1    0  Sunny           35          7
2           2    0   Snow           28          2
3           3    0   Snow           24          4
4           4    0   Rain           32          7
5           5    0  Sunny           31          2

In [52]:
df=pd.read_csv("d_info.csv",skiprows=1)
df

   0  0.1   Rain  32  6
0  1    0  Sunny  35  7
1  2    0   Snow  28  2
2  3    0   Snow  24  4
3  4    0   Rain  32  7
4  5    0  Sunny  31  2

In [ ]:
df=pd.read_csv("d_info.csv",name)
df

In [10]:
p_info=[{"id":1,"name":"pavan","sal":60000},
        {"id":2,"name":"pavan1","sal":80000},
        {"id":3,"name":"pavan2","sal":50000},
        {"id":9,"name":"pavan7,","sal":10000},
        {"id":10,"name":"pavan8,","sal":110000}]
        # how to find max
        # min

In [ ]:
# Handle Missing Data: fillna, dropna, interpolate

In [11]:
p_info

[{'id': 1, 'name': 'pavan', 'sal': 60000},
 {'id': 2, 'name': 'pavan1', 'sal': 80000},
 {'id': 3, 'name': 'pavan2', 'sal': 50000},
 {'id': 9, 'name': 'pavan7,', 'sal': 10000},
 {'id': 10, 'name': 'pavan8,', 'sal': 110000}]

In [14]:
pf=pd.DataFrame(p_info)

In [15]:
print pf

   id     name     sal
0   1    pavan   60000
1   2   pavan1   80000
2   3   pavan2   50000
3   9  pavan7,   10000
4  10  pavan8,  110000

In [17]:
pf.to_csv("p_info.csv") # create csv file

In [26]:
p=pf.to_json()# we can convert json format
# not mantion file name return json
# if manstion crete json formate

In [27]:
p

'{"id":{"0":1,"1":2,"2":3,"3":9,"4":10},"name":{"0":"pavan","1":"pavan1","2":"pavan2","3":"pavan7,","4":"pavan8,"},"sal":{"0":60000,"1":80000,"2":50000,"3":10000,"4":110000}}'

In [29]:
pf

   id     name     sal
0   1    pavan   60000
1   2   pavan1   80000
2   3   pavan2   50000
3   9  pavan7,   10000
4  10  pavan8,  110000

In [32]:
pf[pf["name"]=="pavan"]

   id   name    sal
0   1  pavan  60000

In [33]:
max_sal=pf["sal"].max()

In [34]:
max_sal

110000

In [35]:
pf[pf["sal"]==max_sal]

   id     name     sal
4  10  pavan8,  110000

In [36]:
pf.head() # retun defl 5 record 1sr

   id     name     sal
0   1    pavan   60000
1   2   pavan1   80000
2   3   pavan2   50000
3   9  pavan7,   10000
4  10  pavan8,  110000

In [37]:
pf.head(3) # retun defl 5 record 1sr

   id    name    sal
0   1   pavan  60000
1   2  pavan1  80000
2   3  pavan2  50000

In [39]:
pf.tail(2) # lat

   id     name     sal
3   9  pavan7,   10000
4  10  pavan8,  110000

In [41]:
pf[3:]

   id     name     sal
3   9  pavan7,   10000
4  10  pavan8,  110000

In [42]:
pf[:-2]

   id    name    sal
0   1   pavan  60000
1   2  pavan1  80000
2   3  pavan2  50000

In [47]:
pf.ix[0]

C:\Users\DELL\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

id          1
name    pavan
sal     60000
Name: 0, dtype: object

In [48]:
pf.ix[1]

C:\Users\DELL\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

id           2
name    pavan1
sal      80000
Name: 1, dtype: object

In [49]:
pf[0:3]

   id    name    sal
0   1   pavan  60000
1   2  pavan1  80000
2   3  pavan2  50000

In [51]:
pf.ix[0]

C:\Users\DELL\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

id          1
name    pavan
sal     60000
Name: 0, dtype: object

In [52]:
pf.loc[0] # this 3 case index ,postin same

id          1
name    pavan
sal     60000
Name: 0, dtype: object

In [53]:
pf.iloc[0]

id          1
name    pavan
sal     60000
Name: 0, dtype: object

In [54]:
pf

   id     name     sal
0   1    pavan   60000
1   2   pavan1   80000
2   3   pavan2   50000
3   9  pavan7,   10000
4  10  pavan8,  110000

In [59]:
 pf.index

RangeIndex(start=0, stop=5, step=1)

In [60]:
#df not lose index
# df mantance dublicate index
import matplotlib.pyplot as plt

In [62]:
In [1]: import matplotlib as plt

In [65]:
pf=plot(kind="bar")
plt.throw()

NameError: name 'plot' is not defined

In [86]:
data=df.read_csv("d_info.csv")

AttributeError: 'DataFrame' object has no attribute 'read_csv'

In [84]:
data=pf.read_csv("p_info.csv")

NameError: name 'pf' is not defined